report/statistics.json
{
  "Request for Booking Creation" : {
    "transaction" : "Request for Booking Creation",
    "sampleCount" : 29391,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.399067741825707,
    "medianResTime" : 27.0,
    "minResTime" : 23.0,
    "maxResTime" : 111.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 34.0,
    "pct3ResTime" : 41.0,
    "throughput" : 16.36869125098437,
    "receivedKBytesPerSec" : 91.61447704552252,
    "sentKBytesPerSec" : 10.650198543339078
  },
  "Request for Booking Creation-0" : {
    "transaction" : "Request for Booking Creation-0",
    "sampleCount" : 29391,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.675649008199741,
    "medianResTime" : 13.0,
    "minResTime" : 11.0,
    "maxResTime" : 85.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 21.0,
    "throughput" : 16.368837111385616,
    "receivedKBytesPerSec" : 11.41758268619963,
    "sentKBytesPerSec" : 4.987380057375305
  },
  "Post Booking Form-1" : {
    "transaction" : "Post Booking Form-1",
    "sampleCount" : 29372,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.637205501838487,
    "medianResTime" : 14.0,
    "minResTime" : 11.0,
    "maxResTime" : 62.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 22.0,
    "throughput" : 16.372242772066183,
    "receivedKBytesPerSec" : 80.21439647212505,
    "sentKBytesPerSec" : 5.664091568053893
  },
  "Post Booking Form" : {
    "transaction" : "Post Booking Form",
    "sampleCount" : 29372,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.560976440146938,
    "medianResTime" : 27.0,
    "minResTime" : 23.0,
    "maxResTime" : 98.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 35.0,
    "pct3ResTime" : 41.0,
    "throughput" : 16.372124134279066,
    "receivedKBytesPerSec" : 91.63369063192403,
    "sentKBytesPerSec" : 15.049242777239726
  },
  "Post Booking Form-0" : {
    "transaction" : "Post Booking Form-0",
    "sampleCount" : 29372,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.837396159607831,
    "medianResTime" : 13.0,
    "minResTime" : 11.0,
    "maxResTime" : 77.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 21.0,
    "throughput" : 16.372270150261233,
    "receivedKBytesPerSec" : 11.41997726443262,
    "sentKBytesPerSec" : 9.385275955276702
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 206232,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.591047946002448,
    "medianResTime" : 16.0,
    "minResTime" : 11.0,
    "maxResTime" : 135.0,
    "pct1ResTime" : 23.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 33.0,
    "throughput" : 57.316757964598075,
    "receivedKBytesPerSec" : 473.8779091662011,
    "sentKBytesPerSec" : 28.33154941066282
  },
  "Request for Booking Creation-1" : {
    "transaction" : "Request for Booking Creation-1",
    "sampleCount" : 29391,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.641965227450651,
    "medianResTime" : 14.0,
    "minResTime" : 11.0,
    "maxResTime" : 77.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 22.0,
    "throughput" : 16.368818878693304,
    "receivedKBytesPerSec" : 80.19762140078544,
    "sentKBytesPerSec" : 5.662907081501023
  },
  "Get Login" : {
    "transaction" : "Get Login",
    "sampleCount" : 7559,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.803413149887563,
    "medianResTime" : 14.0,
    "minResTime" : 11.0,
    "maxResTime" : 104.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 22.0,
    "throughput" : 2.101227518269338,
    "receivedKBytesPerSec" : 9.554018872130897,
    "sentKBytesPerSec" : 0.5621684104564075
  },
  "Request for Root" : {
    "transaction" : "Request for Root",
    "sampleCount" : 14853,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.946879418299389,
    "medianResTime" : 15.0,
    "minResTime" : 12.0,
    "maxResTime" : 99.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 25.0,
    "throughput" : 4.142724140258532,
    "receivedKBytesPerSec" : 272.21419580218316,
    "sentKBytesPerSec" : 1.1004110997561725
  },
  "Post Login" : {
    "transaction" : "Post Login",
    "sampleCount" : 7531,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.00172619837997,
    "medianResTime" : 18.0,
    "minResTime" : 14.0,
    "maxResTime" : 135.0,
    "pct1ResTime" : 22.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 32.0,
    "throughput" : 2.0943389720024337,
    "receivedKBytesPerSec" : 10.27126007558225,
    "sentKBytesPerSec" : 1.0369432214894863
  }
}